---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksetTable..::..GetWorkset Method
WorksetTable Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetWorkset(Guid) | Returns the workset from a input Guid. |
|  | GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |

# See Also

WorksetTable Class

WorksetTable Members

Autodesk.Revit.DB Namespace